load-test.yml
config:
  target: 'https://pusaka-newsletter-cepngvzyp-blckouts-projects.vercel.app'
  phases:
    # Warm up phase - 10 users over 1 minute
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    
    # Ramp up phase - gradually increase to 50 users
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up"
    
    # Sustained load - 50 concurrent users for 5 minutes
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Spike test - sudden increase to 100 users
    - duration: 60
      arrivalRate: 100
      name: "Spike test"

scenarios:
  - name: "Newsletter browsing"
    weight: 60
    flow:
      - get:
          url: "/"
      - get:
          url: "/api/editions"
      - think: 3
      - get:
          url: "/api/articles"

  - name: "User authentication"
    weight: 20
    flow:
      - get:
          url: "/login"
      - think: 2
      - get:
          url: "/register"

  - name: "API endpoints"
    weight: 20
    flow:
      - get:
          url: "/api/editions"
      - think: 1
      - get:
          url: "/api/articles"
      - think: 2
      - get:
          url: "/api/articles?editionId=edition-1"